Table of Contents
 Class CrossSectionParameter
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section defined by parameters
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CrossSection,CI.CrossSection", "CI.StructModel.Libraries.CrossSection.ICrossSection,CI.BasicTypes", typeof(CrossSection))]
public class CrossSectionParameter : CrossSection
Inheritance
object
OpenObject
OpenElementId
CrossSection
CrossSectionParameter
Inherited Members
 CrossSection.Name
 CrossSection.CrossSectionRotation
 CrossSection.IsInPrincipal
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CrossSectionParameter()
Constructor
public CrossSectionParameter()
Properties
 CrossSectionType
Type of cross-section
public CrossSectionType CrossSectionType { get; set; }
Property Value
CrossSectionType
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 Parameters
Parameters
public List<Parameter> Parameters { get; set; }
Property Value
List<Parameter>
 Edit this page